---
kind: other
id: Methods.T:Autodesk.Revit.DB.FormArrayIterator
source: html/7717bf86-8fed-d93b-bac7-cc67e3e6ba96.htm
---
# FormArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.